---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.CannotDrawExtrusions
source: html/d5381d57-2404-ea23-ccfb-b56da8c718c7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.CannotDrawExtrusions Property

Can't make Extrusion.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawExtrusions { get; }
```